[Killed] LogicalOperator
src/promisify.js:6:15
 const util = require('util');
 
 module.exports = function (theModule, ignoreKeys) {
-	ignoreKeys = ignoreKeys || [];
+	ignoreKeys = ignoreKeys && [];
 	function isCallbackedFunction(func) {
 		if (typeof func !== 'function') {
killedBy: All tests
statusReason: !




  0 passing (5ms)
  1 failing

[Killed] ConditionalExpression
src/promisify.js:6:15
 const util = require('util');
 
 module.exports = function (theModule, ignoreKeys) {
-	ignoreKeys = ignoreKeys || [];
+	ignoreKeys = true;
 	function isCallbackedFunction(func) {
 		if (typeof func !== 'function') {
killedBy: All tests
statusReason: !


  0 passing (3ms)
  1 failing


  1) promisify (object mutator)

[Killed] BlockStatement
src/promisify.js:7:38
 
 module.exports = function (theModule, ignoreKeys) {
 	ignoreKeys = ignoreKeys || [];
-	function isCallbackedFunction(func) {
-		if (typeof func !== 'function') {
-			return false;
-		}
-		const str = func.toString().split('\n')[0];
-		return str.includes('callback)');
-	}
+	function isCallbackedFunction(func) {}
 
 	function isAsyncFunction(fn) {
killedBy: All tests
statusReason: !




  0 passing (3ms)

  1 failing

[Killed] ConditionalExpression
src/promisify.js:8:7
 module.exports = function (theModule, ignoreKeys) {
 	ignoreKeys = ignoreKeys || [];
 	function isCallbackedFunction(func) {
-		if (typeof func !== 'function') {
+		if (true) {
 			return false;
 		}
killedBy: All tests
statusReason: !



  0 passing (4ms)
  1 failing

  1) promisify (object mutator)

[Killed] EqualityOperator
src/promisify.js:8:7
 module.exports = function (theModule, ignoreKeys) {
 	ignoreKeys = ignoreKeys || [];
 	function isCallbackedFunction(func) {
-		if (typeof func !== 'function') {
+		if (typeof func === 'function') {
 			return false;
 		}
killedBy: All tests
statusReason: !


  0 passing (9ms)
  1 failing

  1) promisify (object mutator)
       adds Promise support to callback-style fn and callback support to async fn:

[Survived] BooleanLiteral
src/promisify.js:9:11
 	ignoreKeys = ignoreKeys || [];
 	function isCallbackedFunction(func) {
 		if (typeof func !== 'function') {
-			return false;
+			return true;
 		}
 		const str = func.toString().split('\n')[0];

[Killed] StringLiteral
src/promisify.js:11:37
 		if (typeof func !== 'function') {
 			return false;
 		}
-		const str = func.toString().split('\n')[0];
+		const str = func.toString().split("")[0];
 		return str.includes('callback)');
 	}
killedBy: All tests
statusReason: !




  0 passing (3ms)
  1 failing

[Timeout] BlockStatement
src/promisify.js:15:31
 		return str.includes('callback)');
 	}
 
-	function isAsyncFunction(fn) {
-		return fn && fn.constructor && fn.constructor.name === 'AsyncFunction';
-	}
+	function isAsyncFunction(fn) {}
 
 	function promisifyRecursive(module) {

[Killed] LogicalOperator
src/promisify.js:16:10
 	}
 
 	function isAsyncFunction(fn) {
-		return fn && fn.constructor && fn.constructor.name === 'AsyncFunction';
+		return fn && fn.constructor || fn.constructor.name === 'AsyncFunction';
 	}
 
killedBy: All tests
statusReason: !




  0 passing (3ms)
  1 failing

[Killed] EqualityOperator
src/promisify.js:16:34
 	}
 
 	function isAsyncFunction(fn) {
-		return fn && fn.constructor && fn.constructor.name === 'AsyncFunction';
+		return fn && fn.constructor && fn.constructor.name !== 'AsyncFunction';
 	}
 
killedBy: All tests
statusReason: !




  0 passing (3ms)

  1 failing

[Killed] BlockStatement
src/promisify.js:19:38
 		return fn && fn.constructor && fn.constructor.name === 'AsyncFunction';
 	}
 
-	function promisifyRecursive(module) {
-		if (!module) {
-			return;
-		}
-
-		const keys = Object.keys(module);
-		keys.forEach((key) => {
-			if (ignoreKeys.includes(key)) {
-				return;
-			}
-			if (isAsyncFunction(module[key])) {
-				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
-			} else if (isCallbackedFunction(module[key])) {
-				module[key] = wrapPromise(module[key], util.promisify(module[key]));
-			} else if (typeof module[key] === 'object') {
-				promisifyRecursive(module[key]);
-			}
-		});
-	}
+	function promisifyRecursive(module) {}
 
 	function wrapCallback(origFn, callbackFn) {
killedBy: All tests
statusReason: !



  0 passing (7ms)
  1 failing

[Killed] ConditionalExpression
src/promisify.js:20:7
 	}
 
 	function promisifyRecursive(module) {
-		if (!module) {
+		if (true) {
 			return;
 		}
killedBy: All tests
statusReason: !




  0 passing (6ms)

  1 failing

[Killed] BooleanLiteral
src/promisify.js:20:7
 	}
 
 	function promisifyRecursive(module) {
-		if (!module) {
+		if (module) {
 			return;
 		}
killedBy: All tests
statusReason: !




  0 passing (2ms)

  1 failing

[Killed] BlockStatement
src/promisify.js:25:25
 		}
 
 		const keys = Object.keys(module);
-		keys.forEach((key) => {
-			if (ignoreKeys.includes(key)) {
-				return;
-			}
-			if (isAsyncFunction(module[key])) {
-				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
-			} else if (isCallbackedFunction(module[key])) {
-				module[key] = wrapPromise(module[key], util.promisify(module[key]));
-			} else if (typeof module[key] === 'object') {
-				promisifyRecursive(module[key]);
-			}
-		});
+		keys.forEach((key) => {});
 	}
 
killedBy: All tests
statusReason: !




  0 passing (6ms)

  1 failing

[Killed] ConditionalExpression
src/promisify.js:26:8
 
 		const keys = Object.keys(module);
 		keys.forEach((key) => {
-			if (ignoreKeys.includes(key)) {
+			if (true) {
 				return;
 			}
killedBy: All tests
statusReason: !




  0 passing (4ms)
  1 failing

[Survived] ConditionalExpression
src/promisify.js:26:8
 
 		const keys = Object.keys(module);
 		keys.forEach((key) => {
-			if (ignoreKeys.includes(key)) {
+			if (false) {
 				return;
 			}

[Killed] ConditionalExpression
src/promisify.js:29:8
 			if (ignoreKeys.includes(key)) {
 				return;
 			}
-			if (isAsyncFunction(module[key])) {
+			if (true) {
 				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
 			} else if (isCallbackedFunction(module[key])) {
killedBy: All tests
statusReason: !




  0 passing (4ms)
  1 failing

[Timeout] ConditionalExpression
src/promisify.js:29:8
 			if (ignoreKeys.includes(key)) {
 				return;
 			}
-			if (isAsyncFunction(module[key])) {
+			if (false) {
 				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
 			} else if (isCallbackedFunction(module[key])) {

[Killed] ConditionalExpression
src/promisify.js:31:15
 			}
 			if (isAsyncFunction(module[key])) {
 				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
-			} else if (isCallbackedFunction(module[key])) {
+			} else if (false) {
 				module[key] = wrapPromise(module[key], util.promisify(module[key]));
 			} else if (typeof module[key] === 'object') {
killedBy: All tests
statusReason: !




  0 passing (6ms)

  1 failing

[Killed] BlockStatement
src/promisify.js:31:50
 			}
 			if (isAsyncFunction(module[key])) {
 				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
-			} else if (isCallbackedFunction(module[key])) {
-				module[key] = wrapPromise(module[key], util.promisify(module[key]));
-			} else if (typeof module[key] === 'object') {
+			} else if (isCallbackedFunction(module[key])) {} else if (typeof module[key] === 'object') {
 				promisifyRecursive(module[key]);
 			}
killedBy: All tests
statusReason: !




  0 passing (3ms)
  1 failing

[Survived] BlockStatement
src/promisify.js:33:48
 				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
 			} else if (isCallbackedFunction(module[key])) {
 				module[key] = wrapPromise(module[key], util.promisify(module[key]));
-			} else if (typeof module[key] === 'object') {
-				promisifyRecursive(module[key]);
-			}
+			} else if (typeof module[key] === 'object') {}
 		});
 	}

[Survived] ConditionalExpression
src/promisify.js:33:15
 				module[key] = wrapCallback(module[key], util.callbackify(module[key]));
 			} else if (isCallbackedFunction(module[key])) {
 				module[key] = wrapPromise(module[key], util.promisify(module[key]));
-			} else if (typeof module[key] === 'object') {
+			} else if (true) {
 				promisifyRecursive(module[key]);
 			}

[Killed] BlockStatement
src/promisify.js:39:44
 		});
 	}
 
-	function wrapCallback(origFn, callbackFn) {
-		return function wrapperCallback(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
-				const cb = args.pop();
-				args.push((err, res) => (res !== undefined ? cb(err, res) : cb(err)));
-				return callbackFn(...args);
-			}
-			return origFn(...args);
-		};
-	}
+	function wrapCallback(origFn, callbackFn) {}
 
 	function wrapPromise(origFn, promiseFn) {
killedBy: All tests
statusReason: !




  0 passing (6ms)

  1 failing

[Killed] BlockStatement
src/promisify.js:40:44
 	}
 
 	function wrapCallback(origFn, callbackFn) {
-		return function wrapperCallback(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
-				const cb = args.pop();
-				args.push((err, res) => (res !== undefined ? cb(err, res) : cb(err)));
-				return callbackFn(...args);
-			}
-			return origFn(...args);
-		};
+		return function wrapperCallback(...args) {};
 	}
 
killedBy: All tests
statusReason: !




  0 passing (8ms)

  1 failing

[Killed] ConditionalExpression
src/promisify.js:41:8
 
 	function wrapCallback(origFn, callbackFn) {
 		return function wrapperCallback(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
+			if (true) {
 				const cb = args.pop();
 				args.push((err, res) => (res !== undefined ? cb(err, res) : cb(err)));
killedBy: All tests
statusReason: !




  0 passing (7ms)
  1 failing

[Killed] ConditionalExpression
src/promisify.js:41:23
 
 	function wrapCallback(origFn, callbackFn) {
 		return function wrapperCallback(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
+			if (args.length && true) {
 				const cb = args.pop();
 				args.push((err, res) => (res !== undefined ? cb(err, res) : cb(err)));
killedBy: All tests
statusReason: !




  0 passing (7ms)

  1 failing

[Killed] EqualityOperator
src/promisify.js:43:30
 		return function wrapperCallback(...args) {
 			if (args.length && typeof args[args.length - 1] === 'function') {
 				const cb = args.pop();
-				args.push((err, res) => (res !== undefined ? cb(err, res) : cb(err)));
+				args.push((err, res) => (res === undefined ? cb(err, res) : cb(err)));
 				return callbackFn(...args);
 			}
killedBy: All tests
statusReason: !




  0 passing (8ms)

  1 failing

[Killed] ConditionalExpression
src/promisify.js:43:30
 		return function wrapperCallback(...args) {
 			if (args.length && typeof args[args.length - 1] === 'function') {
 				const cb = args.pop();
-				args.push((err, res) => (res !== undefined ? cb(err, res) : cb(err)));
+				args.push((err, res) => (false ? cb(err, res) : cb(err)));
 				return callbackFn(...args);
 			}
killedBy: All tests
statusReason: !




  0 passing (7ms)

  1 failing

[Killed] BlockStatement
src/promisify.js:50:42
 		};
 	}
 
-	function wrapPromise(origFn, promiseFn) {
-		return function wrapperPromise(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
-				return origFn(...args);
-			}
-
-			return promiseFn(...args);
-		};
-	}
+	function wrapPromise(origFn, promiseFn) {}
 
 	promisifyRecursive(theModule);
killedBy: All tests
statusReason: !




  0 passing (3ms)

  1 failing

[Killed] BlockStatement
src/promisify.js:51:43
 	}
 
 	function wrapPromise(origFn, promiseFn) {
-		return function wrapperPromise(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
-				return origFn(...args);
-			}
-
-			return promiseFn(...args);
-		};
+		return function wrapperPromise(...args) {};
 	}
 
killedBy: All tests
statusReason: !




  0 passing (3ms)

  1 failing

[Killed] EqualityOperator
src/promisify.js:52:23
 
 	function wrapPromise(origFn, promiseFn) {
 		return function wrapperPromise(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
+			if (args.length && typeof args[args.length - 1] !== 'function') {
 				return origFn(...args);
 			}
killedBy: All tests
statusReason: !




  0 passing (3ms)

  1 failing

[Killed] LogicalOperator
src/promisify.js:52:8
 
 	function wrapPromise(origFn, promiseFn) {
 		return function wrapperPromise(...args) {
-			if (args.length && typeof args[args.length - 1] === 'function') {
+			if (args.length || typeof args[args.length - 1] === 'function') {
 				return origFn(...args);
 			}
killedBy: All tests
statusReason: !




  0 passing (4ms)

  1 failing
